# GetWallPrefStyle

## Description
Gets the name of the current document default wall style

```pascal
FUNCTION GetWallPrefStyle : STRING;
```

```python

def vs.GetWallPrefStyle():
    return STRING
```

## Remarks
Gets the name of the current document default wall style

## Version
Availability: from VectorWorks12.0
## Category
* Document Settings